backend/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
      events = Event.all

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dancing event"], ["description", "summer 2021 coming up"], ["created_at", "2021-02-25 00:30:56.776310"], ["updated_at", "2021-02-25 00:30:56.776310"]]
---
    def create
      event = Event.new(event_params)
      if event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      event = Event.find_by(id: params[:id])