backend/app/controllers/participants_controller.rb

SELECT "participants".* FROM "participants"
---
    def index
      participants = Participant.all

INSERT INTO "participants" ("full_name", "email", "phone_number", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      participant = Participant.create(participant_params)